{
  "nav_portfolio_link": "Portfólio",
  "generic_go_to_portfolio": "ir para portfólio",
  "generic_contact": "Contato",
  "generic_visit": "visitar",
  "generic_show_project": "Ver projeto",

  "home_welcome_portfolio": "Olá, seja bem-vindx ao meu portfólio",
  "home_about_me": "Sobre mim",
  "home_about_me_text": "Sou um desenvolvedor Full Stack júnior em busca de novos desafios. Gosto de aprender sobre tecnologias que me ajudam a trazer soluções rápidas, eficientes, de forma estruturada e limpa. Tenho facilidade em aprender novas linguagens e boas habilidades de comunicação, já tendo liderado uma equipe de consultoria com mais quatro integrantes. Venho trabalhando com tecnologias modernas (<strong>NodeJS</strong>, <strong>Javascript</strong>, <strong>React</strong>, <strong>HTML</strong>, <strong>CSS</strong>) e estou em busca de vagas remotas. Possuo bastante experiência com esse modelo de trabalho visto que atuo dessa forma desde 2015 em empresas como Lionbridge, Appen e IsoftStone. Quando não estou codando, costumo passar o tempo livre pedalando, velejando ou fotografando paisagens.",

  "contact_link_section_text": "Interessadx em fazer projetos comigo?",
  "portfolio_detailed_project": "Projeto",
  "portfolio_portfolio_name": "Portfólio",
  "portfolio_portfolio_text": "Esse foi o meu primeiro desafio do Curso Full Stack da Cubos Academy. A proposta do desafio foi de construir um website com navegação entre diferentes páginas, utilizando o flexbox para criar o layout.",
  "portfolio_cubos_text": "Esse projeto foi o segundo desafio do Curso Full Stack da Cubos Academy. No projeto original foi utilizando apenas Javascript, HTML e CSS. Ao final do curso, refatorei o código com o React, fiz a implementação da responsividade mobile utilizando Bootstrap 5 e algumas features novas.",
  "portfolio_dindin_text": "Em Breve",
  "portfolio_paycheck_text": "Em Breve",
  "portfolio_nav_next": "Próxima Seção",
  "portfolio_nav_previous": "Seção Anterior",

  "portfolio_text": "A criação do layout de portfólio foi meu primeiro desafio do curso. A construção foi bem simples utilizando <strong>HTML</strong> e <strong>CSS<strong>. O principal objetivo foi de praticar a criação de layouts com flexbox.",
  "portfolio_project_text": "O projeto teve como objetivo reproduzir o design proposto em um arquivo do figma utilizando o sistema flexbox e com navegação entre as páginas utilizando tags <strong>HTML</strong>. A navegação do projeto original foi feita com tags <strong>HTML</strong> <a>. Após a refatoração do projeto com <strong>React</strong>, a navegação passou a ser feita com NavLinks e controlada com alguns hooks do react-router-dom. Além disso, adicionei responsividade utilizando o <strong>Bootstrap 5</strong>",
  "portfolio_technologies": "Design interativo / Desenvolvimento Front End",

  "cubos_flix_text": "O Cubos Flix é um site que consome dados de uma API externa de filmes e exibe informações como: título, nota do filme, data de lançamento e descrição. O projeto foi desenvolvido utilizando <strong>Javascript</strong>, <strong>React</strong>, <strong>HTML</strong> e <strong>SASS</strong>.",
  "cubos_flix_technologies": "Design interativo / Desenvolvimento Front End",
  "cubos_flix_project_text": "Este projeto foi o segundo desafio do Curso da Cubos Academy. O projeto teve como objetivo consumir dados de uma API externa de filmes e exibi-las de acordo com o design fornecido no Figma. Fiz algumas modificações no layout original para torná-lo responsivo para usuários mobile e implementei novas funções como a separação por gênero reutilizando componentes React. Além disso, o usuário pode pesquisar os filmes por nome, navegar lateralmente pelos filmes e obter a descrição ao clicar em um filme.",

  "cubos_dindin_text": "Em Breve",
  "cubos_dindin_technologies": "Em Breve",
  "cubos_dindin_project_text": "Em Breve",

  "cubos_paycheck_text": "Em Breve",
  "cubos_paycheck_technologies": "Em Breve",
  "cubos_paycheck_project_text": "Em Breve",

  "contact_title": "Entre em contato",
  "contact_text": "Atualmente estou procurando por vagas de emprego de forma remota e aberto para oportunidades com Front-End, Back-End ou Full Stack. Para entrar em contato, pode me enviar uma messagem através do formulário abaixou ou através dos meus perfis no final da página.",
  "contact_form_name": "Nome",
  "contact_form_message": "Mensagem",
  "contact_form_message_placeholder": "Digite sua mensagem...",
  "contact_form_submit": "Enviar"
}
